import numpy as np

# 读取 .npy 文件
# 编码后的output/vq/2024-10-27-19-36-20_300stepVQ/codebook/中的npy，应该是一串数字，表示的是pose对应在codebook中的索引
# data = np.load('output/vq/2024-11-05-18-37-19_L2-vq-baseline/codebook/000004.npy')
'''
[[7499 7499 7499  134  134 4525 5420 6572 6572 3611 3611 3611  168 1969
  1969  398  398  398 1085 5925 5925 3185 1085  398  398  398  398  398
   398  398 6123 5992 1085 1085 7335  905 7335 1085 7160 7160  905 4285
   398  398  398  398  398  398   73]]
数据类型: int64
数据形状: (1, 49)
'''
data = np.load('dataset/HumanML3D/new_joint_vecs/000000.npy')
'''
[[ 1.8849882e-01 -1.3555324e-04 -2.5729595e-03 ...  1.0000000e+00
   1.0000000e+00  1.0000000e+00]
 [ 7.8636473e-03 -3.1025102e-04 -5.6386786e-03 ...  1.0000000e+00
   1.0000000e+00  1.0000000e+00]
 [ 8.0689769e-03  1.8338533e-04 -7.1479091e-03 ...  1.0000000e+00
   1.0000000e+00  1.0000000e+00]
 ...
 [ 1.7896295e-05 -2.1797296e-04 -4.1049242e-04 ...  1.0000000e+00
   1.0000000e+00  1.0000000e+00]
 [ 1.7307699e-05 -1.5414983e-04 -2.6490807e-04 ...  1.0000000e+00
   1.0000000e+00  1.0000000e+00]
 [ 1.6182661e-05 -4.9140628e-05 -8.2438899e-05 ...  1.0000000e+00
   1.0000000e+00  1.0000000e+00]]
数据类型: float32
数据形状: (116, 263)
'''

# 打印数据内容
print(data)

# 查看数据类型和形状
print("数据类型:", data.dtype)
print("数据形状:", data.shape)


# import pickle

# # 指定 .pkl 文件的路径
# file_path = 'glove/our_vab_words.pkl'

# # 读取 .pkl 文件
# with open(file_path, 'rb') as file:
#     data = pickle.load(file)

# # 打印数据内容
# print(len(data))